[
  {
    "timestamp": "2025-09-12T12:00:33.740Z",
    "kind": "url",
    "method": "model",
    "url": "https://www.bbc.com/news/articles/cly0e4k750go",
    "inputChars": 3552,
    "result": {
      "text": "South Korean companies will be \"very hesitant\" about investing in the US following a massive immigration raid at a Hyundai plant in the state of Georgia last week, President Lee Jae Myung has said. More than 300 South Koreans who were arrested in the raid have now been released from detention and are due to return home on Friday after having their release delayed by more than a day. Their departure was delayed because of an instruction from the White House, Lee added. President Donald Trump ordered the pause to check whether the workers were willing to remain in the US to continue working and training Americans, according to a South Korean foreign ministry official. Lee, who was speaking at a news conference to mark the first 100 days of his presidency, said \"the situation is extremely bewildering,\" while noting it is common practice for Korean firms to send workers to help set up overseas factories. \"If that's no longer allowed, establishing manufacturing facilities in the US will only become more difficult... making companies question whether it's worth doing at all,\" he added. Seoul is negotiating with Washington on visa options for South Korean workers \"whether that means securing [higher] quotas or creating new visa categories\", Lee said. \"I think the US will address this if they see it as a practical necessity.\" The BBC has contacted the White House for comment. Last week, US officials detained 475 people - more than 300 of them South Korean nationals - who they said were working illegally at the battery facility, one of the largest foreign investment projects in Georgia. LG Energy Solution, which operates the plant with Hyundai, said that many of its employees who were arrested had various types of visas or were under a visa waiver programme. A worker at the plant spoke to the BBC about the panic and confusion during the raid. The employee said the vast majority of the workers detained were mechanics installing production lines at the site, and were employed by a contractor. South Korea, a close US ally in Asia, has pledged to invest tens of billions of dollars in America, partly to offset tariffs. Media in the country have described the raid as a \"shock,\" with the Dong-A Ilbo newspaper warning that it could have \"a chilling effect on the activities of our businesses in the United States\". The Yonhap News Agency published an editorial on Thursday urging the two countries to \"cooperate to repair cracks in their alliance\". The timing of the raid, as the two governments engage in sensitive trade talks, has raised concern in Seoul. The White House has defended the operation at the Hyundai plant, dismissing concerns that the raid could deter foreign investment. On Sunday, US President Donald Trump referenced the raid in a social media post and called for foreign companies to hire Americans. The US government would make it \"quickly and legally possible\" for foreign firms to bring workers into the country if they respected its immigration laws, Trump said. The Korean car maker says many of the arrested workers now want to get back home They were originally expected to leave the US at about 14:30 local time (18:30 GMT) on Wednesday. Choi Mal-ja only managed to break free after biting off about 1.5cm of her alleged attacker's tongue. The president's pledge to restore jobs to American workers is running into conflict with other economic goals. Nearly 500 workers - most of them South Korean nationals - were seized in an immigration raid on a large Korean car plant in the US state of Georgia.",
      "tokens": "south korean compani will hesit invest us follow massiv immigr raid hyundai plant state georgia last week presid lee jae myung 300 south korean arrest raid releas detent due return home fridai have releas delai dai departur delai instruct white hous lee ad presid donald trump order paus check whether worker will remain us continu work train american accord south korean foreign ministri offici lee speak new confer mark first 100 dai presid situat extrem bewild note common practic korean firm send worker help set oversea factori no longer allow establish manufactur facil us will becom difficult make compani question whether worth ad seoul negoti washington visa option south korean worker whether mean secur higher quota creat new visa categori lee think us will address practic necess bbc contact white hous comment last week us offici detain 475 peopl 300 south korean nation work illeg batteri facil on largest foreign invest project georgia lg energi solut oper plant hyundai employe arrest variou type visa visa waiver programm worker plant spoke bbc panic confus raid employe vast major worker detain mechan instal product line site emploi contractor south korea close us alli asia pledg invest ten billion dollar america partli offset tariff media countri describ raid shock dong ilbo newspap warn chill effect activ busi unit state yonhap new agenc publish editori thursdai urg two countri cooper repair crack allianc time raid two govern engag sensit trade talk rais concern seoul white hous defend oper hyundai plant dismiss concern raid deter foreign invest sundai us presid donald trump referenc raid social media post call foreign compani hire american us govern quickli legal possibl foreign firm bring worker countri respect immigr law trump korean car maker sai arrest worker want back home origin expect leav us 14 30 local time 18 30 gmt wednesdai choi mal ja manag break free bite off 5cm alleg attack tongu presid pledg restor job american worker run conflict econom goal nearli 500 worker south korean nation seiz immigr raid larg korean car plant us state georgia",
      "predictedCategory": "real",
      "scores": [
        {
          "label": "real",
          "value": 1.240248252701017e-261
        },
        {
          "label": "fake",
          "value": 1.2646435696561275e-288
        }
      ],
      "sentiment": {
        "neg": 0.061,
        "neu": 0.891,
        "pos": 0.048,
        "compound": -0.7902
      },
      "training": {
        "loadedFromCache": true
      }
    }
  },
  {
    "timestamp": "2025-09-12T12:00:54.360Z",
    "kind": "image",
    "method": "rules",
    "imageName": "Screenshot 2025-09-08 183831.png",
    "inputChars": 1156,
    "result": {
      "text": "v © | @® Facebook X | k fake-and-real-news-dat:  X | | Fake News Detection X | €) zawin/Fake-News-Detec X 4% (9+) Thesis Paper X  @ textclassificationin code X | + = [=] Xx\n€ > CG [A 2% notionso/Thesis-Paper-22d085dfe6528021894ef7795156a7 1c Q & 5\n& Haimonmon'sNot... ([& RN Thesis Dashboard | # Thesis Paper (5) Share ¥¢ -o*\nFrit : ’,\nQ Search ia | we 1\nq 0 kK wa : .\n&) Ci ® ERs aaron SNe\n| 5 i 4h 7 40 \" / . i\nFol RE { a L wey -\nShared and he fra ART 5 y\n. {i th I XY BAT Wy, Ji a\nAl Thesis Dashboard 5% Project. oot ~TQ ” Or r £5 wr PR < ~/\ntt ~ as ER . A /\nAN Back to.. Ca Se | AZ . BES nod BE Re ie HAE Wan\n2 CHAPTER I 2 CHAPTER II\nNecessitie August 28, 2025 Thursday ©\nSs Paper Literatures Tools SDLC Paper SDLC Tools Framework\nIntroduction Polish Survey\n& Papers PE — 100% em—\n&s Backups @ @\nA, Py\n& Graphs .. : | Au w. Re\nEt Wr 2 Lie th GE\nr= a as oA dR\np . 5 Ra 1 TRE ey ait Pd\nHh : iw or Ed al\nSUMMARIES os oS\n\\ [. # « Ld =H vel mai WE\n> Task Summary | J NES PREC ANY Ie om\n(BE (8 As a 2\n= La NTA rs = erg 4\n© CHAPTER III © CHAPTER IV\nNext Thursday © 0%\nPaper Graphs Diagrams Data\nSurvey\n50% w=\na Hacaeic gis @ 5 OS MOCO ® J + © 6 @ ~ 2 we cool\n",
      "predictedCategory": "real",
      "rulesConfidence": 0.2,
      "redFlags": [
        "many ALL-CAPS words"
      ],
      "sentiment": {
        "neg": 0.016,
        "neu": 0.917,
        "pos": 0.067,
        "compound": 0.836
      }
    }
  },
  {
    "timestamp": "2025-09-12T12:00:59.294Z",
    "kind": "image",
    "method": "rules",
    "imageName": "Screenshot 2025-09-08 183831.png",
    "inputChars": 1156,
    "result": {
      "text": "v © | @® Facebook X | k fake-and-real-news-dat:  X | | Fake News Detection X | €) zawin/Fake-News-Detec X 4% (9+) Thesis Paper X  @ textclassificationin code X | + = [=] Xx\n€ > CG [A 2% notionso/Thesis-Paper-22d085dfe6528021894ef7795156a7 1c Q & 5\n& Haimonmon'sNot... ([& RN Thesis Dashboard | # Thesis Paper (5) Share ¥¢ -o*\nFrit : ’,\nQ Search ia | we 1\nq 0 kK wa : .\n&) Ci ® ERs aaron SNe\n| 5 i 4h 7 40 \" / . i\nFol RE { a L wey -\nShared and he fra ART 5 y\n. {i th I XY BAT Wy, Ji a\nAl Thesis Dashboard 5% Project. oot ~TQ ” Or r £5 wr PR < ~/\ntt ~ as ER . A /\nAN Back to.. Ca Se | AZ . BES nod BE Re ie HAE Wan\n2 CHAPTER I 2 CHAPTER II\nNecessitie August 28, 2025 Thursday ©\nSs Paper Literatures Tools SDLC Paper SDLC Tools Framework\nIntroduction Polish Survey\n& Papers PE — 100% em—\n&s Backups @ @\nA, Py\n& Graphs .. : | Au w. Re\nEt Wr 2 Lie th GE\nr= a as oA dR\np . 5 Ra 1 TRE ey ait Pd\nHh : iw or Ed al\nSUMMARIES os oS\n\\ [. # « Ld =H vel mai WE\n> Task Summary | J NES PREC ANY Ie om\n(BE (8 As a 2\n= La NTA rs = erg 4\n© CHAPTER III © CHAPTER IV\nNext Thursday © 0%\nPaper Graphs Diagrams Data\nSurvey\n50% w=\na Hacaeic gis @ 5 OS MOCO ® J + © 6 @ ~ 2 we cool\n",
      "predictedCategory": "real",
      "rulesConfidence": 0.2,
      "redFlags": [
        "many ALL-CAPS words"
      ],
      "sentiment": {
        "neg": 0.016,
        "neu": 0.917,
        "pos": 0.067,
        "compound": 0.836
      }
    }
  },
  {
    "timestamp": "2025-09-12T12:04:52.157Z",
    "kind": "image",
    "method": "rules",
    "imageName": "8a17292d-5706-4a83-8e41-bc116f9996bd.jpg",
    "inputChars": 2167,
    "result": {
      "text": "On Thursday morning, Menendez wept as she addressed the judge.\n\n\"I now know, he's not my saviour. He's not the man I thought he was,” she told the\nJudge referring to her husband, a NY Datly News reporter at the court posted on X.\n\"He was one of the most powerful men tn the most powerful country on earth and\nthere was no way he'd lead me astray or lead me to do anything llegal, or so thought.”\nAt the time of the scheme, Robert Menendez was the highest-ranking Democrat on the\nSenate Foreign Relations Committee, a powerful role that gave him significant\ninfluence over US foretgn policy.\n\nProsecutors said the couple explotted his position to secretly ard the Egyptian\n‘government's interests in Washington. They had sought a sentence of at least seven\nyears for Ms Menendez.\n\nDistrict Judge Stdney H Stetn mstead sentenced her to 54 months, saying the prison\nterm was important to deter others from possibly committing stmilar crimes.\n\"People have to understand there are consequences,” Judge Stetn satd.\n\n‘The judge decided Menendez will not have to begin serving her sentence until next\nsummer, 10 July, so that she can complete necessary medical procedures before she\n‘heads behind bars, according to the Assoctated Press.\n\nNadne Menendez was diagnosed with breast cancer after the ortginal indictments,\nand so she stood trial later than her husband and after she underwent surgery. She\nwore a face mask and pin to court during the proceedings to promote breast cancer\nawareness.\n\nA 2022 FBI search at the couple's New Jersey home uncovered more than $100,000\n(£80,000) worth of gold bars and hundreds of thousands of dollars tn cash tm envelopes\nor hidden mn clothes.\n\nAlong with that evidence, federal prosecutors also shoved the jury text messages\nbetween the couple and their assoctates, as well as a Google search by the former\nsenator asking: \"How much ts one kilo of gold worth?\".\n\nFred Datbes, a New Jersey property developer, and Wael Hana, the Egyptian-born\n‘operator of a halal certiftcatton company, were also charged and convicted for their\nToles.\n\nInsurance broker Jose Urtbe pleaded guilty in March 2024 to charges related tothe\ncorrupt scheme.\n",
      "predictedCategory": "real",
      "rulesConfidence": 0.4,
      "redFlags": [
        "urgency words",
        "money/transfer keywords"
      ],
      "sentiment": {
        "neg": 0.066,
        "neu": 0.868,
        "pos": 0.066,
        "compound": -0.6142
      }
    }
  },
  {
    "timestamp": "2025-09-12T12:05:00.199Z",
    "kind": "image",
    "method": "model",
    "imageName": "8a17292d-5706-4a83-8e41-bc116f9996bd.jpg",
    "inputChars": 2167,
    "result": {
      "text": "On Thursday morning, Menendez wept as she addressed the judge.\n\n\"I now know, he's not my saviour. He's not the man I thought he was,” she told the\nJudge referring to her husband, a NY Datly News reporter at the court posted on X.\n\"He was one of the most powerful men tn the most powerful country on earth and\nthere was no way he'd lead me astray or lead me to do anything llegal, or so thought.”\nAt the time of the scheme, Robert Menendez was the highest-ranking Democrat on the\nSenate Foreign Relations Committee, a powerful role that gave him significant\ninfluence over US foretgn policy.\n\nProsecutors said the couple explotted his position to secretly ard the Egyptian\n‘government's interests in Washington. They had sought a sentence of at least seven\nyears for Ms Menendez.\n\nDistrict Judge Stdney H Stetn mstead sentenced her to 54 months, saying the prison\nterm was important to deter others from possibly committing stmilar crimes.\n\"People have to understand there are consequences,” Judge Stetn satd.\n\n‘The judge decided Menendez will not have to begin serving her sentence until next\nsummer, 10 July, so that she can complete necessary medical procedures before she\n‘heads behind bars, according to the Assoctated Press.\n\nNadne Menendez was diagnosed with breast cancer after the ortginal indictments,\nand so she stood trial later than her husband and after she underwent surgery. She\nwore a face mask and pin to court during the proceedings to promote breast cancer\nawareness.\n\nA 2022 FBI search at the couple's New Jersey home uncovered more than $100,000\n(£80,000) worth of gold bars and hundreds of thousands of dollars tn cash tm envelopes\nor hidden mn clothes.\n\nAlong with that evidence, federal prosecutors also shoved the jury text messages\nbetween the couple and their assoctates, as well as a Google search by the former\nsenator asking: \"How much ts one kilo of gold worth?\".\n\nFred Datbes, a New Jersey property developer, and Wael Hana, the Egyptian-born\n‘operator of a halal certiftcatton company, were also charged and convicted for their\nToles.\n\nInsurance broker Jose Urtbe pleaded guilty in March 2024 to charges related tothe\ncorrupt scheme.\n",
      "tokens": "thursdai morn menendez wept address judg know not saviour not man thought told judg refer husband ny datli new report court post on power men tn power countri earth no lead astrai lead anyth llegal thought time scheme robert menendez highest rank democrat senat foreign relat committe power role gave signific influenc us foretgn polici prosecutor coupl explot posit secretli ard egyptian govern interest washington sought sentenc least seven year ms menendez district judg stdnei stetn mstead sentenc 54 month sai prison term import deter other possibl commit stmilar crime peopl understand consequ judg stetn satd judg decid menendez will not begin serv sentenc next summer 10 juli complet necessari medic procedur head behind bar accord assoct press nadn menendez diagnos breast cancer ortgin indict stood trial later husband underw surgeri wore face mask pin court proceed promot breast cancer awar 2022 fbi search coupl new jersei home uncov 100 000 80 000 worth gold bar hundr thousand dollar tn cash tm envelop hidden mn cloth along evid feder prosecutor shove juri text messag coupl assoct googl search former senat ask ts on kilo gold worth fred datb new jersei properti develop wael hana egyptian born oper halal certiftcatton compani charg convict tole insur broker jose urtb plead guilti march 2024 charg relat toth corrupt scheme",
      "predictedCategory": "real",
      "scores": [
        {
          "label": "real",
          "value": 2.0150367600673017e-194
        },
        {
          "label": "fake",
          "value": 6.0985576182966204e-201
        }
      ],
      "sentiment": {
        "neg": 0.066,
        "neu": 0.868,
        "pos": 0.066,
        "compound": -0.6142
      },
      "training": {
        "loadedFromCache": true
      }
    }
  }
]